-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主機： localhost
-- 產生時間： 2023 年 12 月 08 日 06:42
-- 伺服器版本： 10.4.28-MariaDB
-- PHP 版本： 8.0.28

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `diving`
--

-- --------------------------------------------------------

--
-- 資料表結構 `product`
--

CREATE TABLE `product` (
  `id` int(3) UNSIGNED NOT NULL,
  `img` varchar(100) NOT NULL,
  `name` varchar(50) NOT NULL,
  `price` int(5) NOT NULL,
  `count` varchar(30) NOT NULL,
  `size` varchar(30) NOT NULL,
  `info` longtext NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `valid` tinyint(4) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `product`
--

INSERT INTO `product` (`id`, `img`, `name`, `price`, `count`, `size`, `info`, `created_at`, `valid`) VALUES
(1, '男-防寒衣.png', '防寒衣 FOCEA COMFORT 6 Man - 5mm', 15800, '50', 'XS、S、M、L、XL；黑、灰', '採用高品質Elaskin Neoprene，Fireskin內裏及Water Dam System (Beuchat專利)防止水流入', '2023-12-07 08:02:17', 1),
(2, '女-防寒衣.png', '防寒衣 FOCEA COMFORT 6 Woman - 5mm', 15800, '100', 'XS、S、M、L、XL；黑、灰', '採用高品質Elaskin Neoprene，Fireskin內裏及Water Dam System (Beuchat專利)防止水流入', '2023-12-07 08:02:36', 1),
(3, '充排氣閥組.png', 'AK-07S AIR 2 充排氣閥組', 6000, '55', 'F', '整合備用二級頭與BC充排氣閥\r\n重量(不含管)：201 g\r\n包含27\"AIR 2專用中壓管\r\n適用BC上座孔徑：47 mm', '2023-12-07 08:02:30', 1),
(4, '軟式呼吸管.png', 'ACTIVA TUBAIR 軟式呼吸管', 900, '80', 'F；黑', '弧形管呼吸管採用PU材料模製而成', '2023-12-06 16:21:22', 1),
(5, '蛙鞋.png', 'LIBECCIO SPORT', 5200, '70', '39、40、41、42；藍白', '蛙鞋\r\n材料：3種主要材料\r\n腳套：柔軟舒適的彈性體\r\n蹼面：高科技聚合物，可拆卸式蹼面\r\n重量：1040 g(43/44)', '2023-12-06 16:24:11', 1),
(6, '蛙鞋M.png', '蛙鞋 2510 Maratea', 3800, '65', '尺寸：38~44 cm', '蹼面採用多種複合材質，以達到穩定、高機動性及靈活的效果。蹼面的複合材質設計可使蹼面達到最大角度的彎曲', '2023-12-06 17:20:26', 1),
(7, '橫隔膜平衡式.png', '8701橫膈膜平衡式一級頭', 7000, '10', 'F；黑', '可調橫膈膜平衡式一級頭，中壓可由一級頭外部直接調整，2高壓4低壓出氣孔，支援高氧40%\r\n', '2023-12-06 17:18:36', 1),
(8, '防水包.png', 'STORM防水後背包', 3700, '30', 'F；黑', '完全防水的捲摺結構\r\n外部反光設計，提供防護功能\r\n背負系統，使能輕鬆負載', '2023-12-06 16:26:08', 1),
(9, '潛水毛氈底套鞋.png', '潛水毛氈底套鞋', 1100, '60', '尺寸：22~30 cm', '3 mm Neoprene長筒毛氈底防滑套鞋\r\n內加擋水片，便於穿脫\r\n採用YKK #10 大齒塑鋼拉鍊', '2023-12-06 16:29:12', 1),
(10, '潛水襪.png', '潛水襪', 590, '100', '尺寸：XS~XXL', '3 mm Neoprene 潛水襪\r\n高筒設計，增加保暖效果', '2023-12-06 16:31:23', 1),
(11, '潛水手套.png', '潛水手套', 690, '100', 'S~XL；黑', '手背及手指背部分，採用 2 mm Neoprene 布料，提供良好的保暖性及保護性', '2023-12-06 16:33:34', 1),
(12, '潛水燈.png', 'AL-18LED- 充電式鋁合金潛水燈', 6900, '35', 'F', '充電式鋁合金LED潛水燈', '2023-12-06 16:35:09', 1),
(13, '閃光警示燈.png', 'AL-15A LED閃光警示燈', 1350, '50', 'F', 'LED：Cree XML2-U4\r\n使用時間：72小時以上\r\n警示燈亮度：500+流明\r\n電池：AA *3 (需另購)', '2023-12-06 16:36:50', 1),
(14, '橫膈膜平衡式調節器.png', '8760 橫膈膜平衡式調節器', 11800, '46', 'F', 'YOKE頭-8701可調橫膈膜平衡式一級頭，\r\n中壓可由外部直接調整，\r\n2高壓 4低壓出氣孔/橫式設計，\r\n支援高氧40%，\r\n重量：665 g', '2023-12-06 16:40:37', 1),
(15, '可調式二級頭.png', '8515K SK100 可調式二級頭', 4500, '95', 'F', '順流閥設計的 SK 100 二級頭，擁有外部可調出氣旋鈕，潛水 / 預備潛水調整開關，可避免自動漏氣 (free flow)。標配27吋橡膠黑管及舒適咬嘴。', '2023-12-06 16:42:16', 1),
(16, '雙面鏡 (可配近視).png', 'M-236 雙面鏡 (可配近視)', 1000, '100', 'F；黑', '雙層式設計的襯裙，增加密封性及舒適性，\r\n易於快速調整的按鈕式面鏡邊扣，\r\n輕量化設計，配戴更佳舒適及服貼，\r\n強化玻璃', '2023-12-06 16:44:23', 1),
(17, '潛水面鏡.png', 'M-205SC 自由潛水面鏡', 900, '60', 'F；藍', '使用弧形鏡片的自由潛水面罩，提供潛水員180度的視線範圍\r\n', '2023-12-06 16:46:31', 1),
(18, '三面鏡.png', 'M-3302A 三面鏡', 1000, '65', 'F；藍', '三面鏡可提供前方及兩側視窗更佳的視野範圍，100%高品質矽膠材質', '2023-12-06 16:47:54', 1),
(19, '防浪呼吸管.png', '1032AS 防浪呼吸管', 700, '110', 'F；藍', '頂部防浪頭設計，可減少水自頂部進入呼吸管內，寬扁管設計減低水阻，亦提供最佳的進氣及排水效果', '2023-12-06 16:49:41', 1),
(20, '深度腕錶.png', '6430 深度腕錶', 2900, '25', 'F', '70米深度計，高精度和可讀性', '2023-12-06 16:51:05', 1),
(21, '三用錶.png', '6300 三用錶', 7900, '10', 'F', '潛水三用錶(壓力+深度+指北針)\r\n70米深度計、400 bar 壓力錶', '2023-12-06 16:52:57', 1),
(22, '彈性繩指北針腕錶.png', '6560 彈性繩指北針腕錶', 2100, '15', 'F', '小巧緊湊的全傾斜指北針，快速且易於穿戴，易於調節，高精度和可讀性，用於正面和側面讀數的醒目指標', '2023-12-06 16:54:30', 1),
(23, '桶型乾式袋.png', '7112-15L 桶型乾式袋', 650, '40', 'F；黃', '500D PVC防水布(厚度0.5mm)，附有可拆卸式調整背帶', '2023-12-06 17:15:57', 1),
(24, '浮潛大網袋.png', 'MB-3 浮潛大網袋', 200, '70', 'F', '可放入浮潛三寶：面鏡、呼吸管、蛙鞋，內有小置物袋，束口帶亦可肩背', '2023-12-06 16:57:18', 1),
(25, 'one蛙鞋.png', 'MUNDIAL ONE', 3500, '45', '尺寸：38~44 cm', '具有高靈活性的長蛙鞋(適合初學者或新手)，\r\n一體式腳套與蹼面，\r\n舒適高彈性材質腳套，\r\n導流設計，提供良好的推進力道，\r\n蹼面長度：61 cm', '2023-12-06 16:59:38', 1),
(26, '蛙鞋POWERJET.png', '蛙鞋 POWERJET', 6300, '25', '尺寸：38~44 cm；黃', '超彈性 POWERJET 技術蹼面，減少阻力提供強大的推進力，使蹼面可以更精確的控制，兩個導流排水孔，獨家設計的側邊彈性結構', '2023-12-06 17:01:33', 1),
(27, '蛙鞋mo.png', '蛙鞋 MUNDIAL ONE - 50', 2800, '30', '尺寸：38~44 cm；藍', '半長蛙鞋， 一體式無縫腳套與蹼面', '2023-12-06 17:05:44', 1),
(28, 'TORNADO.png', '9710 NEW TORNADO', 17500, '8', '尺寸：XS~XL', '頸部、肩部採用軟布料包覆，為潛水員提供更多的支撐和緩衝，還有特殊設計高度可調整式胸扣帶，對應多種身材，穿脫便利', '2023-12-06 17:08:46', 1),
(29, 'GLACIER.png', '9200 GLACIER', 17500, '5', '尺寸：XS~L', '夾克式BCD採空氣平衡式設計通體流動、無內膽構造的氣囊, 包括肩帶部份整件都可充氣', '2023-12-06 17:10:18', 1),
(30, '救生衣.png', '9000 CYCLONE', 11900, '20', '尺寸：XXS~XXL', '氣囊：1000D Cordura Nylon 布料，PU塗層，左肩防爆排氣閥，可換成備用二級充排氣閥系統', '2023-12-06 17:12:09', 1),
(31, '鈦合金潛水刀.png', '3006T 鈦合金潛水刀', 2200, '13', 'F；藍', '刀刃含有鋸齒邊緣及割繩功能，刀殼快速釋放取刀；快卸橡膠刀帶\r\n • 材質：鈦合金', '2023-12-06 17:14:04', 1),
(32, '不鏽鋼潛水刀.png', '3006 不鏽鋼潛水刀', 1100, '15', 'F；灰', '刀刃含有鋸齒邊緣及割繩功能，刀殼快速釋放取刀；快卸橡膠刀帶\r\n • 材質：304 S.S.', '2023-12-06 17:15:16', 1),
(33, '頭套.png', '潛水頭套', 1080, '120', '尺寸：S~XL', '3 mm Neoprene 材質布料，加長至肩膀的設計，防止熱量流失', '2023-12-06 17:22:26', 1),
(34, '膠底套鞋.png', '潛水膠底套鞋', 790, '28', '尺寸：38~44 cm', '3 mm Nylon II Neoprene材質布料\r\n • 橡膠鞋底', '2023-12-06 17:23:28', 1),
(35, '裝備帶.png', '7108 浮潛裝備背袋', 1080, '35', 'F；藍', '頂部附有 2.5 cm 寬Nylon織帶，可輕鬆提拿，後側有長度可調的 4 cm 寬Nylon織帶，方便肩背', '2023-12-06 17:25:55', 1);

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `product`
--
ALTER TABLE `product`
  ADD PRIMARY KEY (`id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `product`
--
ALTER TABLE `product`
  MODIFY `id` int(3) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=36;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
